resources/receipt-templates/epson/delivery-receipt.xml

<?xml version="1.0" encoding="utf-8"?><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><epos-print xmlns="http://www.epson-pos.com/schemas/2011/03/epos-print">
{{#store_logo_base64}}
<image width="{{store_logo_width}}" height="{{store_logo_height}}">{{store_logo_base64}}</image>
{{/store_logo_base64}}
{{^store_logo_base64}}
<logo key1="34" key2="48"/>
{{/store_logo_base64}}
<feed line="1"/>
<text lang="en"/>
<text width="1" height="1"/>
<text reverse="false" ul="false" em="true" color="color_1"/>
<text>{{store_name}}</text>
<feed/>
<text reverse="false" ul="false" em="false" color="color_1"/>
<text>Org.nr.: {{organization_number}} MVA</text>
{{#store_address}}
<feed/>
<text lang="en"/>
<text>{{store_address}}</text>
{{/store_address}}
<feed line="2"/>
<text width="1" height="1"/>
<text reverse="false" ul="false" em="true" color="color_1"/>
<text>Ordrebekreftelse – IKKE KVITTERING FOR KJØP</text>
<feed line="1"/>
<text reverse="false" ul="false" em="false" color="color_1" width="1" height="1"/>
<text lang="en"/>
{{#order_number}}
<text>Ordrenummer: {{order_number}}</text>
<feed/>
{{/order_number}}
<text>Kvitteringsnummer: {{receipt_number}}</text>
<feed/>
<text>Dato: {{date_time}}</text>
{{#customer_name}}
<feed/>
<text>Kunde: {{customer_name}}</text>
{{/customer_name}}
{{#customer_phone}}
<feed/>
<text>Telefon: {{customer_phone}}</text>
{{/customer_phone}}
{{#customer_email}}
<feed/>
<text>E-post: {{customer_email}}</text>
{{/customer_email}}
<feed/>
<text>Kasse-ID: {{session_number}}</text>
<feed/>
<text>Ansatt: {{cashier_name}}</text>
<feed/>
<text>—————————————————————————————————————————————</text>
<feed/>
<text>Leverte varer/tjenester:</text>
<feed/>
{{#items}}
{{#formatted_line}}
<text>{{formatted_line}}</text>
{{/formatted_line}}
{{^formatted_line}}
<text>{{name}}        {{quantity}} x {{unit_price}}</text>
{{/formatted_line}}
{{#description_line}}
<feed/>
<text>{{description_line}}</text>
{{/description_line}}
<feed/>
<text lang="en"/>
{{/items}}
<text>—————————————————————————————————————————————</text>
<feed/>
<text>Total: {{currency}} {{total_amount}}</text>
<feed/>
<text>Dette er en kredittsalg som vil bli fakturert senere.</text>
{{#estimated_pickup_date}}
<feed/>
<text reverse="false" ul="false" em="true" color="color_1">Estimert hentedato: {{estimated_pickup_date}}</text>
{{/estimated_pickup_date}}
<feed line="2"/>
<text>—————————————————————————————————————————————</text>
<feed/>
<feed/>
<cut type="feed"/>
</epos-print></s:Body></s:Envelope>
